# Handle missing values

In [56]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as f
spark = SparkSession.builder.appName("Practice").getOrCreate()

In [57]:
df = spark.read.csv("base_salary.csv", header=True,inferSchema=True)

In [58]:
df.show()

+--------+----+----------+------+
|    name| age|experience|salary|
+--------+----+----------+------+
|   Roger|24.0|         2| 24000|
|   Marie|40.0|        10| 40000|
|  Fatima|47.0|         7| 80000|
|    Alex|26.0|         3| 38000|
|   sunny|24.0|         2|  NULL|
|    NULL|25.0|      NULL|  NULL|
|  Robert|50.0|      NULL|  NULL|
|    NULL|48.0|      NULL| 60000|
|Amandine|NULL|         5|  NULL|
|    NULL|NULL|      NULL|  NULL|
|  Armine|NULL|      NULL|  NULL|
+--------+----+----------+------+

In [59]:
df.describe().show()

+-------+-----+------------------+------------------+------------------+
|summary| name|               age|        experience|            salary|
+-------+-----+------------------+------------------+------------------+
|  count|    8|                 8|                 6|                 5|
|   mean| NULL|              35.5| 4.833333333333333|           48400.0|
| stddev| NULL|11.856282240712245|3.1885210782848317|21835.750502329887|
|    min| Alex|              24.0|                 2|             24000|
|    max|sunny|              50.0|                10|             80000|
+-------+-----+------------------+------------------+------------------+

## Drop ine with null values

In [60]:
df.na.drop().show()

+------+----+----------+------+
|  name| age|experience|salary|
+------+----+----------+------+
| Roger|24.0|         2| 24000|
| Marie|40.0|        10| 40000|
|Fatima|47.0|         7| 80000|
|  Alex|26.0|         3| 38000|
+------+----+----------+------+

In [61]:
df.na.drop(how="all").show() #Any by default

+--------+----+----------+------+
|    name| age|experience|salary|
+--------+----+----------+------+
|   Roger|24.0|         2| 24000|
|   Marie|40.0|        10| 40000|
|  Fatima|47.0|         7| 80000|
|    Alex|26.0|         3| 38000|
|   sunny|24.0|         2|  NULL|
|    NULL|25.0|      NULL|  NULL|
|  Robert|50.0|      NULL|  NULL|
|    NULL|48.0|      NULL| 60000|
|Amandine|NULL|         5|  NULL|
|  Armine|NULL|      NULL|  NULL|
+--------+----+----------+------+

In [62]:
df.na.drop(thresh=2).show() # At least 2 NONE values

+--------+----+----------+------+
|    name| age|experience|salary|
+--------+----+----------+------+
|   Roger|24.0|         2| 24000|
|   Marie|40.0|        10| 40000|
|  Fatima|47.0|         7| 80000|
|    Alex|26.0|         3| 38000|
|   sunny|24.0|         2|  NULL|
|  Robert|50.0|      NULL|  NULL|
|    NULL|48.0|      NULL| 60000|
|Amandine|NULL|         5|  NULL|
+--------+----+----------+------+

## Selecting columns and indexing

In [63]:
df.columns

['name', 'age', 'experience', 'salary']

In [64]:
df.head(4)

[Row(name='Roger', age=24.0, experience=2, salary=24000),
 Row(name='Marie', age=40.0, experience=10, salary=40000),
 Row(name='Fatima', age=47.0, experience=7, salary=80000),
 Row(name='Alex', age=26.0, experience=3, salary=38000)]

In [65]:
type(df)

pyspark.sql.dataframe.DataFrame

In [67]:
df.select("name","salary").show()

+--------+------+
|    name|salary|
+--------+------+
|   Roger| 24000|
|   Marie| 40000|
|  Fatima| 80000|
|    Alex| 38000|
|   sunny|  NULL|
|    NULL|  NULL|
|  Robert|  NULL|
|    NULL| 60000|
|Amandine|  NULL|
|    NULL|  NULL|
|  Armine|  NULL|
+--------+------+

## adding columns

In [68]:
df = df.withColumn("month_salary",df['salary']/12)

In [69]:
df.show()

+--------+----+----------+------+------------------+
|    name| age|experience|salary|      month_salary|
+--------+----+----------+------+------------------+
|   Roger|24.0|         2| 24000|            2000.0|
|   Marie|40.0|        10| 40000|3333.3333333333335|
|  Fatima|47.0|         7| 80000| 6666.666666666667|
|    Alex|26.0|         3| 38000|3166.6666666666665|
|   sunny|24.0|         2|  NULL|              NULL|
|    NULL|25.0|      NULL|  NULL|              NULL|
|  Robert|50.0|      NULL|  NULL|              NULL|
|    NULL|48.0|      NULL| 60000|            5000.0|
|Amandine|NULL|         5|  NULL|              NULL|
|    NULL|NULL|      NULL|  NULL|              NULL|
|  Armine|NULL|      NULL|  NULL|              NULL|
+--------+----+----------+------+------------------+